zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/periph/PERI_FMC.h
/*
** ###################################################################
**     Processors:          MC56F84441VLF
**                          MC56F84442VLH
**                          MC56F84451VLF
**                          MC56F84452VLH
**                          MC56F84462VLH
**                          MC56F84540VLF
**                          MC56F84543VLH
**                          MC56F84550VLF
**                          MC56F84553VLH
**                          MC56F84565VLK
**                          MC56F84567VLL
**                          MC56F84587VLL
**                          MC56F84763VLH
**                          MC56F84766VLK
**                          MC56F84769VLL
**                          MC56F84786VLK
**                          MC56F84789VLL
**
**     Version:             rev. 3.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for FMC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 2.0 (2021-02-06)
**         Initial version.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_FMC.h
 * @version 3.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for FMC
 *
 * CMSIS Peripheral Access Layer for FMC
 */

#if !defined(PERI_FMC_H_)
#define PERI_FMC_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MC56F84441VLF))
#include "MC56F84441_COMMON.h"
#elif (defined(CPU_MC56F84442VLH))
#include "MC56F84442_COMMON.h"
#elif (defined(CPU_MC56F84451VLF))
#include "MC56F84451_COMMON.h"
#elif (defined(CPU_MC56F84452VLH))
#include "MC56F84452_COMMON.h"
#elif (defined(CPU_MC56F84462VLH))
#include "MC56F84462_COMMON.h"
#elif (defined(CPU_MC56F84540VLF))
#include "MC56F84540_COMMON.h"
#elif (defined(CPU_MC56F84543VLH))
#include "MC56F84543_COMMON.h"
#elif (defined(CPU_MC56F84550VLF))
#include "MC56F84550_COMMON.h"
#elif (defined(CPU_MC56F84553VLH))
#include "MC56F84553_COMMON.h"
#elif (defined(CPU_MC56F84565VLK))
#include "MC56F84565_COMMON.h"
#elif (defined(CPU_MC56F84567VLL))
#include "MC56F84567_COMMON.h"
#elif (defined(CPU_MC56F84587VLL))
#include "MC56F84587_COMMON.h"
#elif (defined(CPU_MC56F84763VLH))
#include "MC56F84763_COMMON.h"
#elif (defined(CPU_MC56F84766VLK))
#include "MC56F84766_COMMON.h"
#elif (defined(CPU_MC56F84769VLL))
#include "MC56F84769_COMMON.h"
#elif (defined(CPU_MC56F84786VLK))
#include "MC56F84786_COMMON.h"
#elif (defined(CPU_MC56F84789VLL))
#include "MC56F84789_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- FMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FMC_Peripheral_Access_Layer FMC Peripheral Access Layer
 * @{
 */

/** FMC - Register Layout Typedef */
typedef struct {
  __IO uint32_t PFAPR;                             /**< Flash Access Protection Register, offset: 0x0 */
  __IO uint32_t PFB0CR;                            /**< Flash Bank 0 Control Register, offset: 0x2 */
  __I  uint32_t PFB1CR;                            /**< Flash Bank 1 Control Register, offset: 0x4 */
       uint16_t RESERVED_0[122];
  __IO uint32_t TAGVDW0S0;                         /**< Cache Tag Storage, offset: 0x80 */
  __IO uint32_t TAGVDW0S1;                         /**< Cache Tag Storage, offset: 0x82 */
  __IO uint32_t TAGVDW0S2;                         /**< Cache Tag Storage, offset: 0x84 */
  __IO uint32_t TAGVDW0S3;                         /**< Cache Tag Storage, offset: 0x86 */
  __IO uint32_t TAGVDW0S4;                         /**< Cache Tag Storage, offset: 0x88 */
  __IO uint32_t TAGVDW0S5;                         /**< Cache Tag Storage, offset: 0x8A */
  __IO uint32_t TAGVDW0S6;                         /**< Cache Tag Storage, offset: 0x8C */
  __IO uint32_t TAGVDW0S7;                         /**< Cache Tag Storage, offset: 0x8E */
  __IO uint32_t TAGVDW1S0;                         /**< Cache Tag Storage, offset: 0x90 */
  __IO uint32_t TAGVDW1S1;                         /**< Cache Tag Storage, offset: 0x92 */
  __IO uint32_t TAGVDW1S2;                         /**< Cache Tag Storage, offset: 0x94 */
  __IO uint32_t TAGVDW1S3;                         /**< Cache Tag Storage, offset: 0x96 */
  __IO uint32_t TAGVDW1S4;                         /**< Cache Tag Storage, offset: 0x98 */
  __IO uint32_t TAGVDW1S5;                         /**< Cache Tag Storage, offset: 0x9A */
  __IO uint32_t TAGVDW1S6;                         /**< Cache Tag Storage, offset: 0x9C */
  __IO uint32_t TAGVDW1S7;                         /**< Cache Tag Storage, offset: 0x9E */
  __IO uint32_t TAGVDW2S0;                         /**< Cache Tag Storage, offset: 0xA0 */
  __IO uint32_t TAGVDW2S1;                         /**< Cache Tag Storage, offset: 0xA2 */
  __IO uint32_t TAGVDW2S2;                         /**< Cache Tag Storage, offset: 0xA4 */
  __IO uint32_t TAGVDW2S3;                         /**< Cache Tag Storage, offset: 0xA6 */
  __IO uint32_t TAGVDW2S4;                         /**< Cache Tag Storage, offset: 0xA8 */
  __IO uint32_t TAGVDW2S5;                         /**< Cache Tag Storage, offset: 0xAA */
  __IO uint32_t TAGVDW2S6;                         /**< Cache Tag Storage, offset: 0xAC */
  __IO uint32_t TAGVDW2S7;                         /**< Cache Tag Storage, offset: 0xAE */
  __IO uint32_t TAGVDW3S0;                         /**< Cache Tag Storage, offset: 0xB0 */
  __IO uint32_t TAGVDW3S1;                         /**< Cache Tag Storage, offset: 0xB2 */
  __IO uint32_t TAGVDW3S2;                         /**< Cache Tag Storage, offset: 0xB4 */
  __IO uint32_t TAGVDW3S3;                         /**< Cache Tag Storage, offset: 0xB6 */
  __IO uint32_t TAGVDW3S4;                         /**< Cache Tag Storage, offset: 0xB8 */
  __IO uint32_t TAGVDW3S5;                         /**< Cache Tag Storage, offset: 0xBA */
  __IO uint32_t TAGVDW3S6;                         /**< Cache Tag Storage, offset: 0xBC */
  __IO uint32_t TAGVDW3S7;                         /**< Cache Tag Storage, offset: 0xBE */
       uint16_t RESERVED_1[64];
  __IO uint32_t DATAW0S0U;                         /**< Cache Data Storage (upper word), offset: 0x100 */
  __IO uint32_t DATAW0S0L;                         /**< Cache Data Storage (lower word), offset: 0x102 */
  __IO uint32_t DATAW0S1U;                         /**< Cache Data Storage (upper word), offset: 0x104 */
  __IO uint32_t DATAW0S1L;                         /**< Cache Data Storage (lower word), offset: 0x106 */
  __IO uint32_t DATAW0S2U;                         /**< Cache Data Storage (upper word), offset: 0x108 */
  __IO uint32_t DATAW0S2L;                         /**< Cache Data Storage (lower word), offset: 0x10A */
  __IO uint32_t DATAW0S3U;                         /**< Cache Data Storage (upper word), offset: 0x10C */
  __IO uint32_t DATAW0S3L;                         /**< Cache Data Storage (lower word), offset: 0x10E */
  __IO uint32_t DATAW0S4U;                         /**< Cache Data Storage (upper word), offset: 0x110 */
  __IO uint32_t DATAW0S4L;                         /**< Cache Data Storage (lower word), offset: 0x112 */
  __IO uint32_t DATAW0S5U;                         /**< Cache Data Storage (upper word), offset: 0x114 */
  __IO uint32_t DATAW0S5L;                         /**< Cache Data Storage (lower word), offset: 0x116 */
  __IO uint32_t DATAW0S6U;                         /**< Cache Data Storage (upper word), offset: 0x118 */
  __IO uint32_t DATAW0S6L;                         /**< Cache Data Storage (lower word), offset: 0x11A */
  __IO uint32_t DATAW0S7U;                         /**< Cache Data Storage (upper word), offset: 0x11C */
  __IO uint32_t DATAW0S7L;                         /**< Cache Data Storage (lower word), offset: 0x11E */
  __IO uint32_t DATAW1S0U;                         /**< Cache Data Storage (upper word), offset: 0x120 */
  __IO uint32_t DATAW1S0L;                         /**< Cache Data Storage (lower word), offset: 0x122 */
  __IO uint32_t DATAW1S1U;                         /**< Cache Data Storage (upper word), offset: 0x124 */
  __IO uint32_t DATAW1S1L;                         /**< Cache Data Storage (lower word), offset: 0x126 */
  __IO uint32_t DATAW1S2U;                         /**< Cache Data Storage (upper word), offset: 0x128 */
  __IO uint32_t DATAW1S2L;                         /**< Cache Data Storage (lower word), offset: 0x12A */
  __IO uint32_t DATAW1S3U;                         /**< Cache Data Storage (upper word), offset: 0x12C */
  __IO uint32_t DATAW1S3L;                         /**< Cache Data Storage (lower word), offset: 0x12E */
  __IO uint32_t DATAW1S4U;                         /**< Cache Data Storage (upper word), offset: 0x130 */
  __IO uint32_t DATAW1S4L;                         /**< Cache Data Storage (lower word), offset: 0x132 */
  __IO uint32_t DATAW1S5U;                         /**< Cache Data Storage (upper word), offset: 0x134 */
  __IO uint32_t DATAW1S5L;                         /**< Cache Data Storage (lower word), offset: 0x136 */
  __IO uint32_t DATAW1S6U;                         /**< Cache Data Storage (upper word), offset: 0x138 */
  __IO uint32_t DATAW1S6L;                         /**< Cache Data Storage (lower word), offset: 0x13A */
  __IO uint32_t DATAW1S7U;                         /**< Cache Data Storage (upper word), offset: 0x13C */
  __IO uint32_t DATAW1S7L;                         /**< Cache Data Storage (lower word), offset: 0x13E */
  __IO uint32_t DATAW2S0U;                         /**< Cache Data Storage (upper word), offset: 0x140 */
  __IO uint32_t DATAW2S0L;                         /**< Cache Data Storage (lower word), offset: 0x142 */
  __IO uint32_t DATAW2S1U;                         /**< Cache Data Storage (upper word), offset: 0x144 */
  __IO uint32_t DATAW2S1L;                         /**< Cache Data Storage (lower word), offset: 0x146 */
  __IO uint32_t DATAW2S2U;                         /**< Cache Data Storage (upper word), offset: 0x148 */
  __IO uint32_t DATAW2S2L;                         /**< Cache Data Storage (lower word), offset: 0x14A */
  __IO uint32_t DATAW2S3U;                         /**< Cache Data Storage (upper word), offset: 0x14C */
  __IO uint32_t DATAW2S3L;                         /**< Cache Data Storage (lower word), offset: 0x14E */
  __IO uint32_t DATAW2S4U;                         /**< Cache Data Storage (upper word), offset: 0x150 */
  __IO uint32_t DATAW2S4L;                         /**< Cache Data Storage (lower word), offset: 0x152 */
  __IO uint32_t DATAW2S5U;                         /**< Cache Data Storage (upper word), offset: 0x154 */
  __IO uint32_t DATAW2S5L;                         /**< Cache Data Storage (lower word), offset: 0x156 */
  __IO uint32_t DATAW2S6U;                         /**< Cache Data Storage (upper word), offset: 0x158 */
  __IO uint32_t DATAW2S6L;                         /**< Cache Data Storage (lower word), offset: 0x15A */
  __IO uint32_t DATAW2S7U;                         /**< Cache Data Storage (upper word), offset: 0x15C */
  __IO uint32_t DATAW2S7L;                         /**< Cache Data Storage (lower word), offset: 0x15E */
  __IO uint32_t DATAW3S0U;                         /**< Cache Data Storage (upper word), offset: 0x160 */
  __IO uint32_t DATAW3S0L;                         /**< Cache Data Storage (lower word), offset: 0x162 */
  __IO uint32_t DATAW3S1U;                         /**< Cache Data Storage (upper word), offset: 0x164 */
  __IO uint32_t DATAW3S1L;                         /**< Cache Data Storage (lower word), offset: 0x166 */
  __IO uint32_t DATAW3S2U;                         /**< Cache Data Storage (upper word), offset: 0x168 */
  __IO uint32_t DATAW3S2L;                         /**< Cache Data Storage (lower word), offset: 0x16A */
  __IO uint32_t DATAW3S3U;                         /**< Cache Data Storage (upper word), offset: 0x16C */
  __IO uint32_t DATAW3S3L;                         /**< Cache Data Storage (lower word), offset: 0x16E */
  __IO uint32_t DATAW3S4U;                         /**< Cache Data Storage (upper word), offset: 0x170 */
  __IO uint32_t DATAW3S4L;                         /**< Cache Data Storage (lower word), offset: 0x172 */
  __IO uint32_t DATAW3S5U;                         /**< Cache Data Storage (upper word), offset: 0x174 */
  __IO uint32_t DATAW3S5L;                         /**< Cache Data Storage (lower word), offset: 0x176 */
  __IO uint32_t DATAW3S6U;                         /**< Cache Data Storage (upper word), offset: 0x178 */
  __IO uint32_t DATAW3S6L;                         /**< Cache Data Storage (lower word), offset: 0x17A */
  __IO uint32_t DATAW3S7U;                         /**< Cache Data Storage (upper word), offset: 0x17C */
  __IO uint32_t DATAW3S7L;                         /**< Cache Data Storage (lower word), offset: 0x17E */
} FMC_Type;

/* ----------------------------------------------------------------------------
   -- FMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FMC_Register_Masks FMC Register Masks
 * @{
 */

