zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/periph/PERI_FMC.h
/*! @name TAGVDW0S0 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW0S0_valid_MASK                 (0x1UL)
#define FMC_TAGVDW0S0_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW0S0_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S0_valid_SHIFT)) & FMC_TAGVDW0S0_valid_MASK)

#define FMC_TAGVDW0S0_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW0S0_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW0S0_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S0_tag_SHIFT)) & FMC_TAGVDW0S0_tag_MASK)
/*! @} */

/*! @name TAGVDW0S1 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW0S1_valid_MASK                 (0x1UL)
#define FMC_TAGVDW0S1_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW0S1_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S1_valid_SHIFT)) & FMC_TAGVDW0S1_valid_MASK)

#define FMC_TAGVDW0S1_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW0S1_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW0S1_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S1_tag_SHIFT)) & FMC_TAGVDW0S1_tag_MASK)
/*! @} */

/*! @name TAGVDW0S2 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW0S2_valid_MASK                 (0x1UL)
#define FMC_TAGVDW0S2_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW0S2_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S2_valid_SHIFT)) & FMC_TAGVDW0S2_valid_MASK)

#define FMC_TAGVDW0S2_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW0S2_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW0S2_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S2_tag_SHIFT)) & FMC_TAGVDW0S2_tag_MASK)
/*! @} */

/*! @name TAGVDW0S3 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW0S3_valid_MASK                 (0x1UL)
#define FMC_TAGVDW0S3_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW0S3_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S3_valid_SHIFT)) & FMC_TAGVDW0S3_valid_MASK)

#define FMC_TAGVDW0S3_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW0S3_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW0S3_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S3_tag_SHIFT)) & FMC_TAGVDW0S3_tag_MASK)
/*! @} */

/*! @name TAGVDW0S4 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW0S4_valid_MASK                 (0x1UL)
#define FMC_TAGVDW0S4_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW0S4_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S4_valid_SHIFT)) & FMC_TAGVDW0S4_valid_MASK)

#define FMC_TAGVDW0S4_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW0S4_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW0S4_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S4_tag_SHIFT)) & FMC_TAGVDW0S4_tag_MASK)
/*! @} */

/*! @name TAGVDW0S5 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW0S5_valid_MASK                 (0x1UL)
#define FMC_TAGVDW0S5_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW0S5_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S5_valid_SHIFT)) & FMC_TAGVDW0S5_valid_MASK)

#define FMC_TAGVDW0S5_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW0S5_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW0S5_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S5_tag_SHIFT)) & FMC_TAGVDW0S5_tag_MASK)
/*! @} */

/*! @name TAGVDW0S6 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW0S6_valid_MASK                 (0x1UL)
#define FMC_TAGVDW0S6_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW0S6_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S6_valid_SHIFT)) & FMC_TAGVDW0S6_valid_MASK)

#define FMC_TAGVDW0S6_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW0S6_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW0S6_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S6_tag_SHIFT)) & FMC_TAGVDW0S6_tag_MASK)
/*! @} */

/*! @name TAGVDW0S7 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW0S7_valid_MASK                 (0x1UL)
#define FMC_TAGVDW0S7_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW0S7_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S7_valid_SHIFT)) & FMC_TAGVDW0S7_valid_MASK)

#define FMC_TAGVDW0S7_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW0S7_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW0S7_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW0S7_tag_SHIFT)) & FMC_TAGVDW0S7_tag_MASK)
/*! @} */

/*! @name TAGVDW1S0 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW1S0_valid_MASK                 (0x1UL)
#define FMC_TAGVDW1S0_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW1S0_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S0_valid_SHIFT)) & FMC_TAGVDW1S0_valid_MASK)

#define FMC_TAGVDW1S0_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW1S0_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW1S0_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S0_tag_SHIFT)) & FMC_TAGVDW1S0_tag_MASK)
/*! @} */

/*! @name TAGVDW1S1 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW1S1_valid_MASK                 (0x1UL)
#define FMC_TAGVDW1S1_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW1S1_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S1_valid_SHIFT)) & FMC_TAGVDW1S1_valid_MASK)

#define FMC_TAGVDW1S1_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW1S1_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW1S1_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S1_tag_SHIFT)) & FMC_TAGVDW1S1_tag_MASK)
/*! @} */

