zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/periph/PERI_FMC.h
/*! @name TAGVDW1S2 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW1S2_valid_MASK                 (0x1UL)
#define FMC_TAGVDW1S2_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW1S2_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S2_valid_SHIFT)) & FMC_TAGVDW1S2_valid_MASK)

#define FMC_TAGVDW1S2_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW1S2_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW1S2_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S2_tag_SHIFT)) & FMC_TAGVDW1S2_tag_MASK)
/*! @} */

/*! @name TAGVDW1S3 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW1S3_valid_MASK                 (0x1UL)
#define FMC_TAGVDW1S3_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW1S3_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S3_valid_SHIFT)) & FMC_TAGVDW1S3_valid_MASK)

#define FMC_TAGVDW1S3_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW1S3_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW1S3_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S3_tag_SHIFT)) & FMC_TAGVDW1S3_tag_MASK)
/*! @} */

/*! @name TAGVDW1S4 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW1S4_valid_MASK                 (0x1UL)
#define FMC_TAGVDW1S4_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW1S4_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S4_valid_SHIFT)) & FMC_TAGVDW1S4_valid_MASK)

#define FMC_TAGVDW1S4_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW1S4_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW1S4_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S4_tag_SHIFT)) & FMC_TAGVDW1S4_tag_MASK)
/*! @} */

/*! @name TAGVDW1S5 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW1S5_valid_MASK                 (0x1UL)
#define FMC_TAGVDW1S5_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW1S5_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S5_valid_SHIFT)) & FMC_TAGVDW1S5_valid_MASK)

#define FMC_TAGVDW1S5_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW1S5_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW1S5_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S5_tag_SHIFT)) & FMC_TAGVDW1S5_tag_MASK)
/*! @} */

/*! @name TAGVDW1S6 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW1S6_valid_MASK                 (0x1UL)
#define FMC_TAGVDW1S6_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW1S6_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S6_valid_SHIFT)) & FMC_TAGVDW1S6_valid_MASK)

#define FMC_TAGVDW1S6_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW1S6_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW1S6_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S6_tag_SHIFT)) & FMC_TAGVDW1S6_tag_MASK)
/*! @} */

/*! @name TAGVDW1S7 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW1S7_valid_MASK                 (0x1UL)
#define FMC_TAGVDW1S7_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW1S7_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S7_valid_SHIFT)) & FMC_TAGVDW1S7_valid_MASK)

#define FMC_TAGVDW1S7_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW1S7_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW1S7_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW1S7_tag_SHIFT)) & FMC_TAGVDW1S7_tag_MASK)
/*! @} */

/*! @name TAGVDW2S0 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW2S0_valid_MASK                 (0x1UL)
#define FMC_TAGVDW2S0_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW2S0_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW2S0_valid_SHIFT)) & FMC_TAGVDW2S0_valid_MASK)

#define FMC_TAGVDW2S0_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW2S0_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW2S0_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW2S0_tag_SHIFT)) & FMC_TAGVDW2S0_tag_MASK)
/*! @} */

/*! @name TAGVDW2S1 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW2S1_valid_MASK                 (0x1UL)
#define FMC_TAGVDW2S1_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW2S1_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW2S1_valid_SHIFT)) & FMC_TAGVDW2S1_valid_MASK)

#define FMC_TAGVDW2S1_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW2S1_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW2S1_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW2S1_tag_SHIFT)) & FMC_TAGVDW2S1_tag_MASK)
/*! @} */

/*! @name TAGVDW2S2 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW2S2_valid_MASK                 (0x1UL)
#define FMC_TAGVDW2S2_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW2S2_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW2S2_valid_SHIFT)) & FMC_TAGVDW2S2_valid_MASK)

#define FMC_TAGVDW2S2_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW2S2_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW2S2_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW2S2_tag_SHIFT)) & FMC_TAGVDW2S2_tag_MASK)
/*! @} */

/*! @name TAGVDW2S3 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW2S3_valid_MASK                 (0x1UL)
#define FMC_TAGVDW2S3_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW2S3_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW2S3_valid_SHIFT)) & FMC_TAGVDW2S3_valid_MASK)

#define FMC_TAGVDW2S3_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW2S3_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW2S3_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW2S3_tag_SHIFT)) & FMC_TAGVDW2S3_tag_MASK)
/*! @} */

