zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/periph/PERI_FMC.h
/*! @name TAGVDW3S6 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW3S6_valid_MASK                 (0x1UL)
#define FMC_TAGVDW3S6_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW3S6_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW3S6_valid_SHIFT)) & FMC_TAGVDW3S6_valid_MASK)

#define FMC_TAGVDW3S6_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW3S6_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW3S6_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW3S6_tag_SHIFT)) & FMC_TAGVDW3S6_tag_MASK)
/*! @} */

/*! @name TAGVDW3S7 - Cache Tag Storage */
/*! @{ */

#define FMC_TAGVDW3S7_valid_MASK                 (0x1UL)
#define FMC_TAGVDW3S7_valid_SHIFT                (0UL)
/*! valid - 1-bit valid for cache entry */
#define FMC_TAGVDW3S7_valid(x)                   (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW3S7_valid_SHIFT)) & FMC_TAGVDW3S7_valid_MASK)

#define FMC_TAGVDW3S7_tag_MASK                   (0x7FFC0UL)
#define FMC_TAGVDW3S7_tag_SHIFT                  (6UL)
/*! tag - 13-bit tag for cache entry */
#define FMC_TAGVDW3S7_tag(x)                     (((uint32_t)(((uint32_t)(x)) << FMC_TAGVDW3S7_tag_SHIFT)) & FMC_TAGVDW3S7_tag_MASK)
/*! @} */

/*! @name DATAW0S0U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW0S0U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S0U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW0S0U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S0U_data_SHIFT)) & FMC_DATAW0S0U_data_MASK)
/*! @} */

/*! @name DATAW0S0L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW0S0L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S0L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW0S0L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S0L_data_SHIFT)) & FMC_DATAW0S0L_data_MASK)
/*! @} */

/*! @name DATAW0S1U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW0S1U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S1U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW0S1U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S1U_data_SHIFT)) & FMC_DATAW0S1U_data_MASK)
/*! @} */

/*! @name DATAW0S1L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW0S1L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S1L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW0S1L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S1L_data_SHIFT)) & FMC_DATAW0S1L_data_MASK)
/*! @} */

/*! @name DATAW0S2U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW0S2U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S2U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW0S2U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S2U_data_SHIFT)) & FMC_DATAW0S2U_data_MASK)
/*! @} */

/*! @name DATAW0S2L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW0S2L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S2L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW0S2L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S2L_data_SHIFT)) & FMC_DATAW0S2L_data_MASK)
/*! @} */

/*! @name DATAW0S3U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW0S3U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S3U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW0S3U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S3U_data_SHIFT)) & FMC_DATAW0S3U_data_MASK)
/*! @} */

/*! @name DATAW0S3L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW0S3L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S3L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW0S3L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S3L_data_SHIFT)) & FMC_DATAW0S3L_data_MASK)
/*! @} */

/*! @name DATAW0S4U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW0S4U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S4U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW0S4U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S4U_data_SHIFT)) & FMC_DATAW0S4U_data_MASK)
/*! @} */

/*! @name DATAW0S4L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW0S4L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S4L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW0S4L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S4L_data_SHIFT)) & FMC_DATAW0S4L_data_MASK)
/*! @} */

/*! @name DATAW0S5U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW0S5U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S5U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW0S5U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S5U_data_SHIFT)) & FMC_DATAW0S5U_data_MASK)
/*! @} */

/*! @name DATAW0S5L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW0S5L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S5L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW0S5L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S5L_data_SHIFT)) & FMC_DATAW0S5L_data_MASK)
/*! @} */

/*! @name DATAW0S6U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW0S6U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S6U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW0S6U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S6U_data_SHIFT)) & FMC_DATAW0S6U_data_MASK)
/*! @} */

/*! @name DATAW0S6L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW0S6L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S6L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW0S6L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S6L_data_SHIFT)) & FMC_DATAW0S6L_data_MASK)
/*! @} */

/*! @name DATAW0S7U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW0S7U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S7U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW0S7U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S7U_data_SHIFT)) & FMC_DATAW0S7U_data_MASK)
/*! @} */

/*! @name DATAW0S7L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW0S7L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW0S7L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW0S7L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW0S7L_data_SHIFT)) & FMC_DATAW0S7L_data_MASK)
/*! @} */

/*! @name DATAW1S0U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW1S0U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S0U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW1S0U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S0U_data_SHIFT)) & FMC_DATAW1S0U_data_MASK)
/*! @} */

