zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/periph/PERI_FMC.h
/*! @name DATAW1S0L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW1S0L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S0L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW1S0L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S0L_data_SHIFT)) & FMC_DATAW1S0L_data_MASK)
/*! @} */

/*! @name DATAW1S1U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW1S1U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S1U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW1S1U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S1U_data_SHIFT)) & FMC_DATAW1S1U_data_MASK)
/*! @} */

/*! @name DATAW1S1L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW1S1L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S1L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW1S1L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S1L_data_SHIFT)) & FMC_DATAW1S1L_data_MASK)
/*! @} */

/*! @name DATAW1S2U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW1S2U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S2U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW1S2U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S2U_data_SHIFT)) & FMC_DATAW1S2U_data_MASK)
/*! @} */

/*! @name DATAW1S2L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW1S2L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S2L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW1S2L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S2L_data_SHIFT)) & FMC_DATAW1S2L_data_MASK)
/*! @} */

/*! @name DATAW1S3U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW1S3U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S3U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW1S3U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S3U_data_SHIFT)) & FMC_DATAW1S3U_data_MASK)
/*! @} */

/*! @name DATAW1S3L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW1S3L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S3L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW1S3L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S3L_data_SHIFT)) & FMC_DATAW1S3L_data_MASK)
/*! @} */

/*! @name DATAW1S4U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW1S4U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S4U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW1S4U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S4U_data_SHIFT)) & FMC_DATAW1S4U_data_MASK)
/*! @} */

/*! @name DATAW1S4L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW1S4L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S4L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW1S4L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S4L_data_SHIFT)) & FMC_DATAW1S4L_data_MASK)
/*! @} */

/*! @name DATAW1S5U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW1S5U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S5U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW1S5U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S5U_data_SHIFT)) & FMC_DATAW1S5U_data_MASK)
/*! @} */

/*! @name DATAW1S5L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW1S5L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S5L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW1S5L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S5L_data_SHIFT)) & FMC_DATAW1S5L_data_MASK)
/*! @} */

/*! @name DATAW1S6U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW1S6U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S6U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW1S6U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S6U_data_SHIFT)) & FMC_DATAW1S6U_data_MASK)
/*! @} */

/*! @name DATAW1S6L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW1S6L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S6L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW1S6L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S6L_data_SHIFT)) & FMC_DATAW1S6L_data_MASK)
/*! @} */

/*! @name DATAW1S7U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW1S7U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S7U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW1S7U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S7U_data_SHIFT)) & FMC_DATAW1S7U_data_MASK)
/*! @} */

/*! @name DATAW1S7L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW1S7L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW1S7L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW1S7L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW1S7L_data_SHIFT)) & FMC_DATAW1S7L_data_MASK)
/*! @} */

/*! @name DATAW2S0U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW2S0U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S0U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW2S0U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S0U_data_SHIFT)) & FMC_DATAW2S0U_data_MASK)
/*! @} */

/*! @name DATAW2S0L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW2S0L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S0L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW2S0L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S0L_data_SHIFT)) & FMC_DATAW2S0L_data_MASK)
/*! @} */

/*! @name DATAW2S1U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW2S1U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S1U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW2S1U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S1U_data_SHIFT)) & FMC_DATAW2S1U_data_MASK)
/*! @} */

/*! @name DATAW2S1L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW2S1L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S1L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW2S1L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S1L_data_SHIFT)) & FMC_DATAW2S1L_data_MASK)
/*! @} */

/*! @name DATAW2S2U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW2S2U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S2U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW2S2U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S2U_data_SHIFT)) & FMC_DATAW2S2U_data_MASK)
/*! @} */

