zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/periph/PERI_FMC.h
/*! @name DATAW2S2L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW2S2L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S2L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW2S2L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S2L_data_SHIFT)) & FMC_DATAW2S2L_data_MASK)
/*! @} */

/*! @name DATAW2S3U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW2S3U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S3U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW2S3U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S3U_data_SHIFT)) & FMC_DATAW2S3U_data_MASK)
/*! @} */

/*! @name DATAW2S3L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW2S3L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S3L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW2S3L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S3L_data_SHIFT)) & FMC_DATAW2S3L_data_MASK)
/*! @} */

/*! @name DATAW2S4U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW2S4U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S4U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW2S4U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S4U_data_SHIFT)) & FMC_DATAW2S4U_data_MASK)
/*! @} */

/*! @name DATAW2S4L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW2S4L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S4L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW2S4L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S4L_data_SHIFT)) & FMC_DATAW2S4L_data_MASK)
/*! @} */

/*! @name DATAW2S5U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW2S5U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S5U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW2S5U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S5U_data_SHIFT)) & FMC_DATAW2S5U_data_MASK)
/*! @} */

/*! @name DATAW2S5L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW2S5L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S5L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW2S5L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S5L_data_SHIFT)) & FMC_DATAW2S5L_data_MASK)
/*! @} */

/*! @name DATAW2S6U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW2S6U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S6U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW2S6U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S6U_data_SHIFT)) & FMC_DATAW2S6U_data_MASK)
/*! @} */

/*! @name DATAW2S6L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW2S6L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S6L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW2S6L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S6L_data_SHIFT)) & FMC_DATAW2S6L_data_MASK)
/*! @} */

/*! @name DATAW2S7U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW2S7U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S7U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW2S7U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S7U_data_SHIFT)) & FMC_DATAW2S7U_data_MASK)
/*! @} */

/*! @name DATAW2S7L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW2S7L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW2S7L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW2S7L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW2S7L_data_SHIFT)) & FMC_DATAW2S7L_data_MASK)
/*! @} */

/*! @name DATAW3S0U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW3S0U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S0U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW3S0U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S0U_data_SHIFT)) & FMC_DATAW3S0U_data_MASK)
/*! @} */

/*! @name DATAW3S0L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW3S0L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S0L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW3S0L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S0L_data_SHIFT)) & FMC_DATAW3S0L_data_MASK)
/*! @} */

/*! @name DATAW3S1U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW3S1U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S1U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW3S1U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S1U_data_SHIFT)) & FMC_DATAW3S1U_data_MASK)
/*! @} */

/*! @name DATAW3S1L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW3S1L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S1L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW3S1L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S1L_data_SHIFT)) & FMC_DATAW3S1L_data_MASK)
/*! @} */

/*! @name DATAW3S2U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW3S2U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S2U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW3S2U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S2U_data_SHIFT)) & FMC_DATAW3S2U_data_MASK)
/*! @} */

/*! @name DATAW3S2L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW3S2L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S2L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW3S2L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S2L_data_SHIFT)) & FMC_DATAW3S2L_data_MASK)
/*! @} */

/*! @name DATAW3S3U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW3S3U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S3U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW3S3U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S3U_data_SHIFT)) & FMC_DATAW3S3U_data_MASK)
/*! @} */

