zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/periph/PERI_FMC.h
/*! @name DATAW3S3L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW3S3L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S3L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW3S3L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S3L_data_SHIFT)) & FMC_DATAW3S3L_data_MASK)
/*! @} */

/*! @name DATAW3S4U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW3S4U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S4U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW3S4U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S4U_data_SHIFT)) & FMC_DATAW3S4U_data_MASK)
/*! @} */

/*! @name DATAW3S4L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW3S4L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S4L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW3S4L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S4L_data_SHIFT)) & FMC_DATAW3S4L_data_MASK)
/*! @} */

/*! @name DATAW3S5U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW3S5U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S5U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW3S5U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S5U_data_SHIFT)) & FMC_DATAW3S5U_data_MASK)
/*! @} */

/*! @name DATAW3S5L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW3S5L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S5L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW3S5L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S5L_data_SHIFT)) & FMC_DATAW3S5L_data_MASK)
/*! @} */

/*! @name DATAW3S6U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW3S6U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S6U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW3S6U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S6U_data_SHIFT)) & FMC_DATAW3S6U_data_MASK)
/*! @} */

/*! @name DATAW3S6L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW3S6L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S6L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW3S6L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S6L_data_SHIFT)) & FMC_DATAW3S6L_data_MASK)
/*! @} */

/*! @name DATAW3S7U - Cache Data Storage (upper word) */
/*! @{ */

#define FMC_DATAW3S7U_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S7U_data_SHIFT                 (0UL)
/*! data - Bits [63:32] of data entry */
#define FMC_DATAW3S7U_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S7U_data_SHIFT)) & FMC_DATAW3S7U_data_MASK)
/*! @} */

/*! @name DATAW3S7L - Cache Data Storage (lower word) */
/*! @{ */

#define FMC_DATAW3S7L_data_MASK                  (0xFFFFFFFFUL)
#define FMC_DATAW3S7L_data_SHIFT                 (0UL)
/*! data - Bits [31:0] of data entry */
#define FMC_DATAW3S7L_data(x)                    (((uint32_t)(((uint32_t)(x)) << FMC_DATAW3S7L_data_SHIFT)) & FMC_DATAW3S7L_data_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group FMC_Register_Masks */


/*!
 * @}
 */ /* end of group FMC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma pop
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_FMC_H_ */

